{
  "id": 10,
  "author": "Josh and Julia Kramer",
  "role": "Parents (Ashton Kramer - USPHL Bold City Battalion)",
  "text": "Our son Ashton Kramer (USPHL Bold City Batallion, Junior Elite), first met Coach William during the beginnings of Covid when DMV rinks were shutting down. In search of thinning ice as a function of temporary rink closures, Ash found that Ashburn Ice House was the last rink to close and thus, talked us into daily drives to Ashburn although we lived in DC. During one of the back-to-back stick-and-puck sessions, Ashton (then 11 years old) was woking on his slap shot (which Coach William would admit wasn't so great at the time,) and approached to offer some pointers. Then, they started moving the puck and William began feeding pucks for Ash to rip on goal. It became abundantly clear in short order, that Ashton was soaking up William's advice like a dry sponge.\n\nAs I observed from the glass, I sensed a tremendous and overwhelming feeling of passion that is William, and I saw how Ashton was beaming with excitement and putting into play the tweaks and adjustments that William demonstrated. After they came off, I approached William to introduce myself and express my appreciation for spending so much time with Ashton. Then, I asked if he was a coach and he humbly responded that he simply loved the game and upon his observing Ashton's shared passion—he merely wanted to seize the opportunity to help him and make him a better player. Doubling down, I flat-out asked William if he would be willing to coach our son. Flattered although mildly surprised—William agreed. Thus, New Era Hockey was born.\n\nNearly 4 years later, Ashton developed from a stick-n-puck regular, single-A player, to AA bantam, earning a Varsity Roster spot as a Freshman last year at Bullis, and most recently an invitation to work out with the newest expansion USPHL team—Bold City Batallion. Ashton showed up and performed at Bold Camp—and he was completely blown away when he was offered a rostered spot as Bold's only 15 year old (and one of only a few in the nation-wide USPHL). But, do you know who else showed up? Coach William. He literally drove 750 miles to watch Ashton, his first student, take the ice among elite 16-20 year old young men from around the country.\n\nIn addition to hundreds of hours on ice, refining edge-work, breaking down his stride, focusing on head-up stick/handling, William has travelled to dozens Ashton's games, spent countless hours reviewing film, spent countless hours breaking down every facet of his game, observing team practices, motivational talks ahead of taking game ice—and sometimes motivational talks after a disappointing game or tournament. Ashton considers William his \"big brother.\"\n\nWilliam shares so many gifts and perhaps most notable —is his ability to teach at any level of the game. Whether your kiddo is taking their first few steps on the ice or whether they're heading into their first competitive bantam season where contact becomes a concerning modality of the game, Coach William will guide your player to the New Era of Hockey. He will work with you and your player to set realistic and achievable goals and will push your player achieve their very best. He will teach your kids how to play the game effectively, how to protect themselves, how to hit, how to take a hit, how to score, how to be selfless, how to be effective with the puck and without the puck. He will teach you how to have fun, love the game, how to improve your hockey IQ, how to be a well-respected teammate as well as a better human being.\n\nWe are so grateful and proud of Coach William as New Era Hockey has caught fire! Thanks Coach Will!",
  "featured": true
}
