{
  "lastUpdated": "October 2025",
  "sections": [
    {
      "id": "agreement",
      "title": "Agreement to Terms",
      "content": [
        "By accessing and using New Era Hockey services, you agree to be bound by these Terms and Conditions. These terms apply to all users of our training programs, camps, events, and website.",
        "If you disagree with any part of these terms, you may not access our services."
      ]
    },
    {
      "id": "services",
      "title": "Training Services",
      "content": [
        "New Era Hockey provides premium hockey training services in the DMV area, including private coaching, group sessions, camps, and specialized training programs.",
        "All training sessions are conducted by qualified coaches led by Coach William, focusing on skill development, skating techniques, and hockey fundamentals.",
        "Session schedules, locations, and availability are subject to change. We will provide reasonable notice of any modifications.",
        "Participants must arrive on time and prepared with appropriate equipment. Late arrivals may result in shortened session time without refund."
      ]
    },
    {
      "id": "registration",
      "title": "Registration and Payment",
      "content": [
        "This website serves as an informational resource for New Era Hockey services. Registration for programs and events is handled through direct contact with our coaching staff via email, phone, or in-person consultation.",
        "When our online event registration system becomes available, it will collect basic contact information (name, email, phone number) only. Payment arrangements and program details will be coordinated separately.",
        "Payment is due at the time of registration unless alternative arrangements have been made. Payment methods (cash, Venmo, or other arrangements) will be communicated directly by our staff.",
        "All fees are in USD and are non-refundable except as specifically outlined in our cancellation policy.",
        "We reserve the right to cancel or modify programs due to insufficient enrollment, facility issues, or other unforeseen circumstances. In such cases, full refunds will be provided."
      ]
    },
    {
      "id": "cancellation",
      "title": "Cancellation Policy",
      "content": [
        "Camps: All camp registrations are non-refundable. Once registered for a camp, fees cannot be refunded regardless of cancellation timing.",
        "Lessons: Individual lessons must be canceled at least 48 hours before the scheduled lesson time to be eligible for a refund. Cancellations made less than 48 hours before a lesson are non-refundable.",
        "New Era Hockey reserves the right to cancel sessions due to weather, facility closures, or other circumstances beyond our control. Affected participants will be notified promptly and offered rescheduling options or full refunds.",
        "No-shows forfeit the session fee and training time without refund or rescheduling option.",
        "For any questions or concerns regarding cancellations, please contact Coach Will directly. We're happy to help!"
      ]
    },
    {
      "id": "liability",
      "title": "Assumption of Risk and Liability",
      "content": [
        "Hockey is a physical sport that carries inherent risks of injury. By participating in New Era Hockey programs, participants acknowledge and accept these risks.",
        "All participants must have adequate health insurance coverage. New Era Hockey is not responsible for medical expenses resulting from injuries sustained during training.",
        "Participants and guardians (for minors) agree to release New Era Hockey, its coaches, employees, and affiliates from liability for injuries or damages occurring during training sessions.",
        "Participants must disclose any medical conditions, injuries, or physical limitations that may affect their ability to safely participate in training activities."
      ]
    },
    {
      "id": "equipment",
      "title": "Equipment and Safety",
      "content": [
        "Participants must wear appropriate hockey equipment including helmet, gloves, skates, and protective gear as required by the facility and training activity.",
        "All equipment must be in good condition and properly fitted. Coaches may refuse participation if equipment is deemed unsafe.",
        "New Era Hockey is not responsible for lost, stolen, or damaged personal equipment.",
        "Participants must follow all safety guidelines and facility rules during training sessions."
      ]
    },
    {
      "id": "conduct",
      "title": "Code of Conduct",
      "content": [
        "All participants must demonstrate respect, sportsmanship, and professionalism toward coaches, staff, other participants, and facility personnel.",
        "Bullying, harassment, discrimination, or abusive behavior of any kind will not be tolerated and may result in immediate dismissal from programs without refund.",
        "Participants must follow all instructions from coaches and staff regarding training activities and facility usage.",
        "Parents and guardians are expected to support a positive training environment and address concerns through appropriate channels."
      ]
    },
    {
      "id": "media",
      "title": "Media and Photography",
      "content": [
        "New Era Hockey may photograph or video record training sessions for promotional, educational, or documentation purposes.",
        "By participating in our programs, you consent to the use of your or your child's image in marketing materials, social media, and website content unless you explicitly opt out in writing.",
        "Participants may photograph or record their own training for personal use but may not share content featuring other participants without consent."
      ]
    },
    {
      "id": "intellectual-property",
      "title": "Intellectual Property",
      "content": [
        "All training materials, methodologies, and content provided by New Era Hockey are proprietary and protected by copyright.",
        "Participants may not reproduce, distribute, or commercially exploit any training materials without written permission.",
        "The New Era Hockey name, logo, and branding are trademarks and may not be used without authorization."
      ]
    },
    {
      "id": "privacy",
      "title": "Privacy and Data",
      "content": [
        "Personal information collected through our contact form or during registration is used solely for program administration and communication.",
        "Our website collects name, email address, and phone number only. No payment or billing information is collected through this website.",
        "We do not sell or share participant information with third parties except as required by law or as necessary to provide our services.",
        "For complete details on data collection and usage, please review our Privacy Policy."
      ]
    },
    {
      "id": "modifications",
      "title": "Modifications to Terms",
      "content": [
        "New Era Hockey reserves the right to modify these Terms and Conditions at any time.",
        "Changes will be posted on our website with an updated \"Last Updated\" date.",
        "Continued use of our services after changes constitute acceptance of modified terms.",
        "For significant changes, we will make reasonable efforts to notify registered participants."
      ]
    },
    {
      "id": "contact",
      "title": "Contact Information",
      "content": [
        "For questions regarding these Terms and Conditions, please contact us:",
        "Email: coachwill@newerahockeytraining.com",
        "Phone: (571) 274-4691",
        "Instagram: @NewEraHockeyDMV"
      ]
    }
  ]
}
